{
  "home": {
    "titulo": "Normas, Estándares y Herramientas para la Calidad del Software",
    "descripcion": "Las normas, estándares y herramientas para la calidad del software son fundamentales para garantizar que los proyectos de desarrollo cumplan con altos estándares de calidad y sean eficientes, seguros y confiables. Este nodo aborda normas internacionales como ISO/IEC, estándares específicos de calidad como IEEE y CMMI, así como herramientas de aseguramiento como JIRA y SonarQube, que facilitan el control y la mejora continua en todas las fases del desarrollo.",
    "imagen": "/images/nodo1/principal1.png"
  },
  "section_card_video": {
    "titulo": "Normas Internacionales (ISO/IEC)",
    "descripcion": "Las normas ISO/IEC son estándares internacionales que establecen criterios de calidad y mejores prácticas para el desarrollo y gestión de software.",
    "cards": [
      {
        "titulo": "ISO/IEC 25010",
        "descripcion": "Define los modelos de calidad del producto de software, incluyendo características como funcionalidad, confiabilidad, usabilidad, eficiencia, mantenibilidad y portabilidad.",
        "video_url": "https://www.youtube.com/embed/jyIeLQIjnbE"
      },
      {
        "titulo": "ISO/IEC 12207",
        "descripcion": "Proporciona un marco para los procesos del ciclo de vida del software, cubriendo desde la concepción hasta la retirada del software.",
        "video_url": "https://www.youtube.com/embed/59E-k8VFR-4"
      },
      {
        "titulo": "ISO/IEC 25012",
        "descripcion": "Establece requisitos para la calidad de los datos en sistemas de información, cubriendo atributos como exactitud, completitud, consistencia y actualidad de los datos.",
        "video_url": "https://www.youtube.com/embed/e5N5TTD9Gss"
      },
      {
        "titulo": "ISO/IEC 15504 (SPICE)",
        "descripcion": "Conocida también como SPICE (Software Process Improvement and Capability Determination), esta norma permite evaluar la madurez y capacidad de los procesos de software en una organización.",
        "video_url": "https://www.youtube.com/embed/iaz25j1pDz4"
      },
      {
        "titulo": "ISO/IEC 27001",
        "descripcion": "Aunque está orientada a la seguridad de la información, es vital en la calidad de software para garantizar que los datos y operaciones del sistema sean seguras.",
        "video_url": "https://www.youtube.com/embed/shHRkhUUcmo"
      },
      {
        "titulo": "ISO/IEC 25030",
        "descripcion": "Proporciona una guía sobre cómo especificar los requisitos de calidad de software de manera efectiva, asegurando que estos requisitos sean claros y medibles.",
        "video_url": "https://www.youtube.com/embed/y1OjnFBEu9g"
      }
    ]
  },
  "section_medio": {
    "titulo": "IEEE (Institute of Electrical and Electronics Engineers)",
    "descripcion": "El IEEE desarrolla estándares que abordan diversos aspectos de la ingeniería y tecnología, incluyendo el software. Estos estándares ayudan a establecer prácticas y normas que aseguran la calidad en el desarrollo y mantenimiento de software.",
    "contenido": [
      {
        "titulo": "CMMI (Capability Maturity Model Integration)",
        "descripcion": "CMMI es un modelo de mejora de procesos diseñado para ayudar a las organizaciones a desarrollar y perfeccionar sus procesos. Se centra en la gestión y optimización de procesos de desarrollo de software, impulsando prácticas eficientes y repetibles.",
        "imagen": "/images/nodo1/imagen2.png"
      }
    ]
  },
  "section_video_modal": {
    "titulo": "Herramientas de Aseguramiento de Calidad",
    "cards": [
      {
        "titulo": "JIRA",
        "descripcion": "JIRA es una herramienta de gestión de proyectos y seguimiento de problemas que permite a los equipos de desarrollo planificar, rastrear y gestionar el trabajo.",
        "video_url": "https://www.youtube.com/embed/DYDmBoV99Xg",
        "imagen": "/images/nodo1/imagenjira.png"
      },
      {
        "titulo": "SonarQube",
        "descripcion": "SonarQube es una herramienta de análisis de código que ayuda a detectar errores, vulnerabilidades y malas prácticas en el código fuente.",
        "video_url": "https://www.youtube.com/embed/iXDjAuhSDcI",
        "imagen": "/images/nodo1/imagenqube.png"
      },
      {
        "titulo": "TestRail",
        "descripcion": "Para la gestión de pruebas que permite planificar, ejecutar y rastrear resultados de pruebas.",
        "video_url": "https://www.youtube.com/embed/A6Ohlw6-MNg",
        "imagen": "/images/nodo1/imagentest.png"
      },
      {
        "titulo": "Selenium",
        "descripcion": "Selenium es una herramienta de automatización de pruebas de software que se usa principalmente para realizar pruebas de interfaz de usuario en aplicaciones web.",
        "video_url": "https://www.youtube.com/embed/7eUWM3xQMpo",
        "imagen": "/images/nodo1/imagense.png"
      }
    ]
  }
}
